<template>
  <div>
    <!-- <h1 class="center">寻根问祖</h1> -->

    <div class="paragraph">
      <p class="normal">
        常午未带着李清鹂、两个孩子常汉卿，常翠莲和逐渐年迈的母亲瀘紹年踏上了归乡之路。
      </p>

      <p class="normal">
        五月中旬的广东，雨水淅淅沥沥，天空总是阴沉着脸，仿佛随时要倾泻下更多的雨滴。常午未和家人跋涉在泥泞的山路上，鞋子早已被湿透的泥土紧紧裹住，每一步都显得沉重。行李虽然不多，但在这漫长的路途中，背负的重量仿佛越来越沉。
      </p>

      <p class="normal">
        清鹂抱着小汉卿，脸色苍白，脚步也愈发蹒跚。翠莲紧紧抓着母亲的衣角，雨水顺着她的小脸流下，混着汗水和泥水，她小声地问：“阿爹，我们什么时候能到家？”
      </p>

      <p class="normal">
        午未心疼地看了女儿一眼，抬手擦去她脸上的水珠，柔声道：“快了，再走一段路，咱们就到家了。”
      </p>

      <p class="normal">
        可他心里清楚，这条路还远得很。他们虽然身上有钱，但是有钱买不到粮食也没有用。
        这几天他们只能依靠山间的雨水和野草果腹。瀘紹年虽然坚持不说，但午未知道，她的身体状况已经岌岌可危。每次她咬牙坚持的样子都让午未心如刀割。要不是有瀘紹年指路，他们一定找不到回祖屋的方向。
      </p>

      <p class="normal">
        终于，历经几天的跋涉，他们的脚步终于接近了村子。满目疮痍的村庄让他们有些怅然，午未的心情也随之沉重下来。他知道，回到祖屋后，生活还远没有到达平静的彼岸。他们只能相信刘恭可留下的锦囊的指引，要不然他们面前可能是死路一条。
      </p>
    </div>

    <div class="paragraph">
      <p class="normal">
        常午未一家人拖着疲惫的身躯，终于在暮色中回到了他们的祖屋。屋子看起来异常破败，门窗破旧，屋顶上长满了青苔，仿佛多年没有人居住。正当他们犹豫着怎么进入时，邻居王一平正好从田里收工回来，远远地看见了他们。
      </p>

      <p class="normal">“一平哥！”午未眼前一亮，急忙招呼了一声。</p>
      <p class="normal">
        王一平抬头一看，脸上露出惊喜的表情，大步流星地走了过来，“常日昳！真的是你们啊！你们总算回来了！”
      </p>
      <p class="normal">瀘紹年扶着清鹂，一脸疲惫地微笑，“是啊，一平，我们回来了。”</p>
      <p class="normal">
        王一平打量着他们一家人，目光停留在两个孩子身上，顿时心生怜悯，“你们一路上辛苦了，快进屋吧！”
      </p>
      <p class="normal">午未看着破旧的大门，心中不免有些迟疑，“一平哥，这屋子……还能住吗？”</p>
      <p class="normal">
        王一平笑了笑，从衣袋里掏出一串钥匙，“日昳啊，你爹常惜端二十年前回来以后，把这房子赎了回来。这些年都租了出去，我一直帮你们看着呢。这把钥匙，他临走前托我给你们的。”
      </p>
      <p class="normal">
        午未惊讶地接过钥匙，心头一阵温暖，仿佛听到了父亲的叮嘱。瀘紹年更是哽咽着说不出话来，清鹂则紧紧握住午未的手，眼中流露出一丝感动。
      </p>
      <p class="normal">
        “你们进屋吧，我这就去帮你们打点水，清理一下屋子。”王一平说着，麻利地走向邻居家。
      </p>
      <p class="normal">
        午未用钥匙打开了大门，推门而入，一股尘土的气息扑面而来，屋内的摆设已经蒙上了一层厚厚的灰尘，但这些对他们来说已不重要。能有一个落脚的地方，已经是天大的幸运。
      </p>
      <p class="normal">
        不一会儿，王一平回来了，带着一桶清水和几把扫帚。他边打扫边笑着说：“你们父亲心里一直挂念着你们，当初赎回这房子的时候，还专门托我替他收拾了几次。只不过这几年没人住了，难免有些荒废。咱们一起收拾一下，这屋子还能住人。”
      </p>
      <p class="normal">
        午未一家人站在院子中央，看着土灶内的火焰，望着后院那棵蓬勃生长，果实累累的凤眼果，心中重新燃起了希望。
      </p>
    </div>

    <div class="paragraph">
      <p class="normal">
        “贵人禄马到，因缘再续，天官赐福，食神归位。”
        你口中呢喃着这句话，视线逐渐从记忆中淡出。回过神来，刘恭可为首的几位八仙已经站在了你的面前。
      </p>
      <p class="normal">
        “常午未这最后一劫已被你化解，最后还要去一处地方...”
        你的地图再一次展开在空中。“午未这一世就算因缘相合了。”
      </p>
      <p style="margin: 0" class="center">四方圣兽立盒缘，金木水火皆有标，</p>
      <p style="margin: 0" class="center">虎口再开吞二兽，四圣镇守对应处，</p>
      <p style="margin: 0 0 26px 0" class="center">时辰齐聚八仙定，灶君新命卦下藏。</p>
    </div>

    <div class="center subtleFade">
      <p style="margin: 0">到达指示场景处</p>
      <p style="margin: 0">寻找<strong>"午未"</strong>二字</p>
      <p style="margin: 0">将午未放上去</p>
    </div>

    <div class="floating-btn" @click="handleFloatingBtnClick">提示</div>
  </div>
</template>

<script setup>
import { showDialog } from 'vant'

const handleFloatingBtnClick = () => {
  showDialog({
    message:
      '此处会用到盒子本体，日晷，虎口符，地图。灶君是午未，那他新的命格多出来的是哪个卦象呢？'
  })
    .then(() => {})
    .catch(() => {})
}
</script>

<style lang="less" scoped>
@keyframes subtleFade {
  0% {
    opacity: 1;
  }
  50% {
    opacity: 0.5;
  }
  100% {
    opacity: 1;
  }
}
.subtleFade {
  animation: subtleFade 1s infinite;
}
</style>
